[
  {
    "id": "1",
    "name": "Mapo Tofu",
    "img": "https://i.ibb.co/cxQPx1v/62745d5a726045e4a99a3885-cut-750x400-39.webp",
    "description": "Mapo tofu is a popular Chinese dish from the Sichuan province. It is a spicy and flavorful dish made with tofu and ground pork, seasoned with a blend of Sichuan peppercorns, chili bean paste, and fermented black beans. Served over steamed rice, it is a comforting and satisfying meal.",
    "price": 25.99
  },
  {
    "id": "2",
    "name": "Kung Pao Chicken",
    "img": "https://images.chinahighlights.com/allpicture/2019/11/31acb7b302ec4b48b17443ed_cut_750x400_39.webp",
    "description": "Kung Pao chicken is a classic Sichuan dish that is both sweet and spicy. It is made with marinated chicken, stir-fried with peanuts, scallions, and dried red chili peppers. The dish is seasoned with a combination of soy sauce, vinegar, sugar, and Sichuan peppercorns, giving it a complex flavor profile.",
    "price": 25.99
  },
  {
    "id": "3",
    "name": "Hot and Sour Soup",
    "img": "https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/large/1430_30_1436801649.jpg?tr=w-800,h-1066",
    "description": "Hot and sour soup is a staple in Chinese cuisine. It is a tangy and spicy soup made with chicken or pork broth, tofu, bamboo shoots, and wood ear mushrooms. The soup is seasoned with vinegar, soy sauce, and white pepper, giving it a distinctive sour and spicy flavor.",
    "price": 25.99
  },
  {
    "id": "4",
    "name": "Beijing Duck",
    "img": "https://www.curiouscuisiniere.com/wp-content/uploads/2018/10/Peking-Duck-7196-1.jpg.webp",
    "description": "Beijing duck is a famous dish from Beijing. It is made with a whole duck that is roasted until the skin is crispy and golden brown. The duck is served with thin pancakes, scallions, and a sweet bean sauce. The dish is both savory and sweet, with a rich flavor and crispy texture.",
    "price": 25.99
  },
  {
    "id": "5",
    "name": "Dumplings",
    "img": "https://images.chinahighlights.com/allpicture/2019/01/9b7159f6d89449d997eaa5ab_cut_750x400_39.webp",
    "description": "Dumplings are a popular Chinese food that come in many varieties. They are made with a thin layer of dough that is filled with meat, vegetables, or seafood. The dumplings are then steamed or fried, and served with a dipping sauce. They are a comforting and satisfying food that is perfect for any occasion.",
    "price": 25.99
  },
  {
    "id": "6",
    "name": "Ma La Xiang Guo",
    "img": "https://omnivorescookbook.com/wp-content/uploads/2022/01/220120_Mala-Dry-Pot-Mala-Xiang-Guo_3.jpg",
    "description": "Ma la xiang guo is a spicy dish from the Sichuan province. It is made with a variety of meats and vegetables, stir-fried with Sichuan peppercorns, dried red chili peppers, and other spices. The dish is known for its numbing and spicy flavor, and is often served with steamed rice.",
    "price": 25.99
  },
  {
    "id": "7",
    "name": "Sichuan Hot Pot",
    "img": "https://thewoksoflife.com/wp-content/uploads/2015/10/hot-pot-13.jpg",
    "description": "Sichuan Hot Pot is a popular Chinese dish that features a simmering pot of broth, surrounded by plates of raw meats, vegetables, and other ingredients that are cooked by diners at the table. The broth is flavored with a combination of Sichuan peppercorns, chili peppers, and other spices, giving it a spicy and numbing flavor that is both addictive and satisfying.",
    "price": 25.99
  },
  {
    "id": "8",
    "name": "Dan Dan Noodles",
    "img": "https://i.ibb.co/fNF2YbG/dan-dan-noodles-12.jpg",
    "description": "Dan Dan Noodles are a popular and spicy Chinese noodle dish that originated from Sichuan cuisine. The dish consists of a spicy sauce made with preserved vegetables, chili oil, Sichuan peppercorns, and minced pork, which is then poured over a bed of egg noodles. The dish is typically garnished with scallions and sesame seeds.",
    "price": 25.99
  },
  {
    "id": "9",
    "name": "Szechuan Fish",
    "img": "https://i.ibb.co/pJ5Sgbt/fish-szechuan-14612.jpg",
    "description": "Szechuan Fish is a popular and flavorful Chinese fish dish that originates from Sichuan cuisine. The fish is typically marinated in a spicy sauce made with chili oil, Sichuan peppercorns, garlic, and ginger, and then stir-fried with vegetables such as peppers and onions. The dish is known for its bold and spicy flavor, and is often served with steamed rice.",
    "price": 35.99
  },
  {
    "id": "10",
    "name": "Crab Rangoon",
    "img": "https://i.ibb.co/sq0HGRw/crab-rangoon-14-683x1024.jpg",
    "description": "Crab Rangoon is a popular Chinese-American appetizer that consists of a crispy wonton wrapper filled with a mixture of cream cheese, crab meat, garlic, and scallions. The dish is often served with a sweet and sour dipping sauce, and is a favorite at Chinese restaurants and takeout places across the country.",
    "price": 25.99
  },
  {
    "id": "11",
    "name": "Peking Roasted Duck",
    "img": "https://images.chinahighlights.com/allpicture/2021/12/d247e7d25b164b77841f6022_cut_750x400_39.webp",
    "description": "A famous dish from Beijing made by roasting a duck until the skin is crispy and the meat is tender. It is usually served with thin pancakes, sliced cucumbers, and scallions, and eaten by wrapping the duck meat in the pancakes with the vegetables and a sweet bean sauce.",
    "price": 25.99
  },
  {
    "id": "12",
    "name": "Dim Sum",
    "img": "https://images.chinahighlights.com/allpicture/2018/08/16d96371fd2944be86ffbdc1_cut_750x400_39.webp",
    "description": "A type of Chinese cuisine that consists of small bite-sized portions of food served in steamer baskets. Popular dim sum dishes include dumplings, buns, and rolls filled with meat, seafood, or vegetables.",
    "price": 12.99
  },
  {
    "id": "13",
    "name": "Char Siu",
    "img": "https://images.chinahighlights.com/allpicture/2021/12/a57fdce570494d41b624119d_cut_750x400_39.webp",
    "description": "A popular Cantonese dish made with barbecued pork that is typically marinated in a mixture of soy sauce, hoisin sauce, honey, and other spices. It is often served with rice or noodles.",
    "price": 8.99
  },
  {
    "id": "14",
    "name": "Chow Mein",
    "img": "https://images.chinahighlights.com/allpicture/2018/03/10725167158a4b8589bf3140_cut_750x400_39.webp",
    "description": "A stir-fried Chinese dish made with noodles, vegetables, and meat or seafood. The noodles are usually cooked until they are slightly crispy, and the dish is seasoned with soy sauce and other spices.",
    "price": 10.99
  },
  {
    "id": "15",
    "name": "Fried Rice",
    "img": "https://images.chinahighlights.com/allpicture/2014/09/2b424254939d4d51adda30fe_cut_750x400_39.webp",
    "description": "A dish made with cooked rice that has been stir-fried in a wok or a frying pan with vegetables, eggs, and meat. The rice is usually seasoned with soy sauce and other spices, and it can be served as a main dish or a side dish in a Chinese meal.",
    "price": 9.99
  },
  {
    "id": "16",
    "name": "Xiaolongbao",
    "img": "https://images.chinahighlights.com/allpicture/2021/12/e0f37497683b4935b7841043_cut_750x400_39.webp",
    "description": "A type of steamed bun from Jiangsu province in eastern China, often filled with pork and soup. Xiaolongbao are usually served in a bamboo steamer and are eaten by dipping them in vinegar and soy sauce.",
    "price": 7.99
  },
  {
    "id": "17",
    "name": "Zhajiangmian",
    "img": "https://images.chinahighlights.com/allpicture/2021/12/44ca76c8361e41caa43d8859_cut_750x400_39.webp",
    "description": "A Chinese dish made with wheat noodles topped with a thick sauce made of soybean paste, ground meat, and vegetables. Zhajiangmian is usually served with cucumber and bean sprouts, and it can be spicy or non-spicy.",
    "price": 11.99
  },
  {
    "id": "18",
    "name": "Wonton Soup",
    "img": "https://images.chinahighlights.com/allpicture/2017/07/241e8e1b02ef463bafa65702_cut_750x400_39.webp",
    "description": "A soup made with wontons, which are small dumplings filled with ground meat, shrimp, or vegetables. The soup is often flavored with chicken or pork broth and seasoned with soy sauce, ginger, and other spices. It is a popular comfort food in China and can be found in many Chinese restaurants worldwide.",
    "price": 6.99
  }
]
